---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionOverrideType
source: html/14e988cd-db39-b031-d431-1b1ea384fb30.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionOverrideType Property

"Override by Instance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionOverrideType { get; }
```